[
  {
    "company": "Graduate Teaching Assistant — University of Wisconsin–Madison, Computer Science (Part-time)",
    "role": "",
    "location": "Madison, WI, USA",
    "dates": "Aug 2025 – Present",
    "sort": 202508,
    "highlights": [
      "Assist in teaching CS540 - Introduction to Artificial Intelligence, focusing on Deep learning, Natural language processing (NLP), and Probability",
      "Create homework assignments, hold office hours, support students with concepts related to Machine learning and AI."
    ]
  },
  {
    "company": "ZS Associates",
    "role": "Senior AI Software Engineer",
    "location": "Bengaluru, India",
    "dates": "Jun 2024 – Aug 2025",
    "sort": 202406,
    "highlights": [
      "Designed and deployed production-ready Generative AI multimodal agents with advanced text and vision capabilities leveraging Retrieval-Augmented Generation (RAG) improving response accuracy by 30%.",
      "Built GraphRAG, a knowledge graph algorithm for document QA, achieving 20% higher accuracy than RAG agents.",
      "Led multimodal, scalable Multi-Agent AI SaaS applications deployed across 3+ industries with thousands of users.",
      "Specialized in deploying local LLMs with sub-second latency, 100% data privacy compliance for client-facing projects."
    ]
  },
  {
    "company": "Iron Mountain",
    "role": "Senior AI Software Engineer",
    "location": "Bengaluru, India",
    "dates": "Oct 2022 – May 2024",
    "sort": 202210,
    "highlights": [
      "Developed production-ready Intelligent Document Processing AI solutions achieving 99% data extraction accuracy across diverse industries using Natural language processing and Computer vision.",
      "Engineered synthetic signature generation and developed a generalized signature detection model with 98% accuracy.",
      "Fine-tuned large language and multimodal models on domain-specific documents, improving performance by 15%.",
      "Developed production ready AI SaaS applications for document question answering, deployed to 10+ clients."
    ]
  },
  {
    "company": "TensorIoT",
    "role": "Machine Learning Software Engineer",
    "location": "Bengaluru, India",
    "dates": "Oct 2021 – Oct 2022",
    "sort": 202110,
    "highlights": [
      "Developed time series forecasting models achieving 97% accuracy to predict employee attrition rates.",
      "Created a customized Alexa skill via the Alexa Developer Console to enhance customer purchase journeys.",
      "Developed a deep neural network, achieving 98% accuracy in detecting 15 distinct wall paint defects.",
      "Implemented predictive maintenance models for anomaly detection in machinery and sensors.",
      "Engineered an end-to-end A/B testing MLOps CI/CD pipeline on AWS, adaptable for machine learning use cases.",
      "Developed a customer journey tracking solution leveraging computer vision algorithms."
    ]
  },
  {
    "company": "ABB",
    "role": "Computer Vision Researcher",
    "location": "Bengaluru, India",
    "dates": "Jan 2021 – Sep 2021",
    "sort": 202101,
    "highlights": [
      "Developed AI vision inspection for robotics manufacturing lines, boosting defect detection and reducing manual labor."
    ]
  },
  {
    "company": "Vijna Labs",
    "role": "Artificial Intelligence Intern",
    "location": "Bengaluru, India",
    "dates": "Jul 2018 – Aug 2018",
    "sort": 201807,
    "highlights": [
      "Worked on real time object detection, image processing, computer vision and training neural networks."
    ]
  }
]